In [34]:
import pandas as pd

dic_data = {'이름': ['서준','우현','인아'],
            '수학': [90,80,70],
            '영어': [98,89,95],
            '음악': [85,95,100],
            '체육': [100,90,90]}
df = pd.DataFrame(dic_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [35]:
df.set_index('이름',inplace=True)
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [40]:
df.loc['서준']['체육']=90
print(df)

    수학  영어   음악  체육
이름
서준  90  98   85  90
우현  80  89   95  90
인아  70  95  100  90

In [46]:
df.loc['서준',['음악','체육']] = 50
df.loc['서준',['음악','체육']] = 100, 50 # 파이썬에선 숫자를 콤마로 나열할시 튜플로 저장됨
df

    수학  영어   음악  체육
이름
서준  90  98  100  50
우현  80  89   95  90
인아  70  95  100  90

In [49]:
df2 = df.transpose() # 행과 열 바꿔줌
df2

이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악  100  95  100
체육   50  90   90